Autodesk.Revit.DB.DWFExportOptions.ExportOnlyViewId
Only export the specified view.
Remarks: Export only the specified view, but the data of the other views is still used, e. g. the hyperlink information.
Since: 2019

Autodesk.Revit.DB.DWFExportOptions.CropBoxVisible
Whether to export crop box.
Remarks: The default value is false.
Since: 2015

Autodesk.Revit.DB.DWFExportOptions.ImageQuality
Image quality level when compressed raster format(JPEG) is used.
Remarks: The default value is Default.

Autodesk.Revit.DB.DWFExportOptions.ImageFormat
Controls the compression level of images embedded.
Remarks: ImageQuality is ignored when ImageFormat is set to "PNG"-the standard format.

Autodesk.Revit.DB.DWFExportOptions.PortraitLayout
Paper orientation - Portrait/Landscape.

Autodesk.Revit.DB.DWFExportOptions.PaperFormat
Standard paper format.

Autodesk.Revit.DB.DWFExportOptions.StopOnError
Whether export process should stop when a view fails to export.
Remarks: If set to false, the export would continue until all views are processed.
This option has an effect only when a set of more than one view is specified.

Autodesk.Revit.DB.DWFExportOptions.ExportObjectData
Whether to include properties associated with elements.
Remarks: ExportObjectData must be enabled (true) in order to also
enable exporting rooms and areas (ExportingAreas). If ExportObjectData
is disabled, the ExportingAreas property will be ignored.

Autodesk.Revit.DB.DWFExportOptions.MergedViews
Whether to merge all views in one file.

Autodesk.Revit.DB.DWFExportOptions.ExportTexture
Whether to export texture.
Remarks: The default value is true. This property only take effect to 3D DWF.
Since: 2015 Subscription Update

Autodesk.Revit.DB.DWFExportOptions.ExportingAreas
Whether to also export areas and rooms' geometry.

Autodesk.Revit.DB.DWFExportOptions.#ctor
Default constructor. Sets all options to their default values.

Autodesk.Revit.DB.DWFExportOptions
DWF Export options.